# Ex - GroupBy

In [1]:
import numpy as np
import pandas as pd

### Step 2. Importar el conjunto de datos de esta [dirección](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'

### Step 3.  Asignarlo a una variable llamada drinks.

In [29]:
drinks = pd.read_csv(url)
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [4]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [7]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

### Step 4. ¿Qué continente bebe más cerveza de media?

In [8]:
drinks.groupby('continent')[['beer_servings']].mean()

           beer_servings
continent
AF             61.471698
AS             37.045455
EU            193.777778
OC             89.687500
SA            175.083333

In [27]:
lista_paises = drinks[drinks['continent'].isnull()]['country'].values
lista_paises

array(['Antigua & Barbuda', 'Bahamas', 'Barbados', 'Belize', 'Canada',
       'Costa Rica', 'Cuba', 'Dominica', 'Dominican Republic',
       'El Salvador', 'Grenada', 'Guatemala', 'Haiti', 'Honduras',
       'Jamaica', 'Mexico', 'Nicaragua', 'Panama', 'St. Kitts & Nevis',
       'St. Lucia', 'St. Vincent & the Grenadines', 'Trinidad & Tobago',
       'USA'], dtype=object)

In [30]:
drinks['continent'].fillna("NCA", inplace=True)

In [31]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [34]:
drinks.groupby('continent')[['beer_servings']].mean()

           beer_servings
continent
AF             61.471698
AS             37.045455
EU            193.777778
NCA           145.434783
OC             89.687500
SA            175.083333

In [35]:
drinks.groupby('continent')[['beer_servings']].mean().sort_values('beer_servings',ascending=False).iloc[:1,:]

           beer_servings
continent
EU            193.777778

In [17]:
# drinks = pd.read_csv(url)

In [20]:
# drinks[drinks['country'].isin(['USA','Canada','Mexico'])][['continent']]

    continent
32        NaN
109       NaN
184       NaN

In [23]:
# drinks[drinks['country'].isin(['USA','Canada','Mexico'])]['continent'].fillna("NA")

32     NA
109    NA
184    NA
Name: continent, dtype: object

### Step 5. Para cada continente saca las estadísticas de consumo de vino.

In [40]:
drinks.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
NCA         23.0   24.521739  28.266378  1.0   5.0   11.0   34.00  100.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### Step 6. Imprimir la media de consumo de alcohol por continente para cada columna

In [42]:
print(drinks.groupby('continent').mean())

           beer_servings  spirit_servings  wine_servings  \
continent
AF             61.471698        16.339623      16.264151
AS             37.045455        60.840909       9.068182
EU            193.777778       132.555556     142.222222
NCA           145.434783       165.739130      24.521739
OC             89.687500        58.437500      35.625000
SA            175.083333       114.750000      62.416667

           total_litres_of_pure_alcohol
continent
AF                             3.007547
AS                             2.170455
EU                             8.617778
NCA                            5.995652
OC                             3.381250
SA                             6.308333

### Step 7. Imprimir la mediana del consumo de alcohol por continente para cada columna

In [44]:
print(drinks.groupby('continent').median())

           beer_servings  spirit_servings  wine_servings  \
continent
AF                  32.0              3.0            2.0
AS                  17.5             16.0            1.0
EU                 219.0            122.0          128.0
NCA                143.0            137.0           11.0
OC                  52.5             37.0            8.5
SA                 162.5            108.5           12.0

           total_litres_of_pure_alcohol
continent
AF                                 2.30
AS                                 1.20
EU                                10.00
NCA                                6.30
OC                                 1.75
SA                                 6.85

### Step 8. Imprime los valores medios, mínimos y máximos del consumo de alcohol por continente.

In [47]:
drinks.groupby('continent')[['spirit_servings']].agg(['mean',min,'max',np.median])

          spirit_servings
                     mean min  max median
continent
AF              16.339623   0  152    3.0
AS              60.840909   0  326   16.0
EU             132.555556   0  373  122.0
NCA            165.739130  68  438  137.0
OC              58.437500   0  254   37.0
SA             114.750000  25  302  108.5

In [49]:
min([2,3,5])
# mean([2,3,5])

NameError: name 'mean' is not defined